package intCons

var (
	//--------------------------------统一返回码------------------------------------------------------------------
	CODE_SUCC			int32		=	0		//成功时候的代码
	CODE_FAIL			int32		=	-1		//失败时候的代码

	//--------------------------------活动奖励--------------------------------------------------------------------
	REWARDS_TYPE_ONLINE		int32		= 1				//在线奖励
	REWARDS_TYPE_TURNTABLE		int32		= 2				//转盘奖励
	REWARDS_TYPE_SIGNIN		int32		= 3				//签到奖励
	REWARDS_TYPE_TIMING		int32		= 4				//定时领奖
	REWARDS_TYPE_RELIEF		int32		= 5				//救济金

	//------------------------------登陆注册----------------------------------------------------------------------
	LOGIN_WAY_QUICK			int8		= 1		//快速登录模式
	LOGIN_WAY_LOGIN 		int8		= 2		//普通登录模式



	//------------------------------请求房间----------------------------------------------------------------------

	REQ_TYPE_IN			int32		= 1
	REQ_TYPE_OUT			int32 		= 0
)
